JEP/Hpoo/AG3RegionNNvalue_NotFound/HpooResponseError.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><Service_Provisioning_Info xmlns="http://rjil.com/ericsson/inventoryProvisioning/datastructure"><Service_Information><Service_ID>111010</Service_ID></Service_Information><Node_List><Node><Node_Name>INMUMUMBXXXXNB0016ENBESS003</Node_Name><Node_HostName>MUMBRLB1ECR001</Node_HostName><Node_Type>L2 Switch</Node_Type><Node_Vendor>RAD LTD</Node_Vendor><Node_Model>RL-ETX203AX</Node_Model><Template_ID>L2_TemplateR03</Template_ID><Template_Name>L2_Ring_tagged_BW_RAD</Template_Name><Parameter_List><Parameter>$ProductType$:IPC</Parameter><Parameter>$ServiceCode$:IPC</Parameter><Parameter>$shaper_bandwidth$:5024</Parameter><Parameter>$WAN_IP_1$:100.64.128.112</Parameter><Parameter>$ServiceID$:111010</Parameter><Parameter>$CustomerID$:9190052610</Parameter><Parameter>$VLAN_TAGGED$:TAGGED</Parameter><Parameter>$CUSTOMERNAME$:Tfnhq</Parameter><Parameter>$VLANID$:1634</Parameter><Parameter>$bandwidth$:5 Mbps</Parameter><Parameter>$PORT$:21</Parameter><Parameter>$PORT2:Ethernet 2</Parameter><Parameter>$PORT_ID$:21</Parameter><Parameter>$CustomerName$:Tfnhq</Parameter><Parameter>$policer_bandwidth$:5056</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$InterfaceDescription$:UNI-ENT-IP Centrex-TFNH-5 Mbps-111010</Parameter><Parameter>$b_bandwidth$:5 Mbps</Parameter><Parameter>$TCoS$:</Parameter><Parameter>$q_dirblock$:0/6</Parameter><Parameter>$pbit$:6</Parameter><Parameter>$ring_number$:</Parameter></Parameter_List></Node><Node><Node_Name>INMUMUMBXXXXNB0016ENBESR001</Node_Name><Node_HostName>BGLRRLABECR001</Node_HostName><Node_Type>CSS</Node_Type><Node_Vendor>CISCO</Node_Vendor><Node_Model>CS-A901-6CZ-F-D-ESR</Node_Model><Template_ID>CSS_Template13</Template_ID><Template_Name>NON-RIL_Ethernet_SIP_CSS_Primary_IPManaged</Template_Name><Parameter_List><Parameter>$VRFName$:RJIL-VRF-IP-CENTRIX</Parameter><Parameter>$WAN_IP_1$:100.64.128.112</Parameter><Parameter>$CustomerID$:9190052610</Parameter><Parameter>$bc_bandwidth$:937500</Parameter><Parameter>$rt_import$:64914:10001</Parameter><Parameter>$WANIP-1 NW$:100.64.128.112</Parameter><Parameter>$WANIP-2-VRRP$:100.64.128.115</Parameter><Parameter>$CUSTOMERNAME$:Tfnhq</Parameter><Parameter>$VLANID$:1634</Parameter><Parameter>$WANIP-3$:100.64.128.113</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$InterfaceDescription$:UNI-ENT-IP Centrex-TFNH-5 Mbps-111010</Parameter><Parameter>$TCoS$:</Parameter><Parameter>$Port0$:GigabitEthernet0/0/8</Parameter><Parameter>$b_bandwidth$:5 Mbps</Parameter><Parameter>$description$:UNI-ENT-IP Centrex-TFNH-5 Mbps-111010</Parameter><Parameter>$rt_export$:64914:100</Parameter><Parameter>$device_ip$:10.64.229.240</Parameter><Parameter>$pbit$:6</Parameter><Parameter>$Route Distinguisher$:19.44.0.63:65</Parameter><Parameter>$ProductType$:IPC</Parameter><Parameter>$ServiceCode$:IPC</Parameter><Parameter>$ServiceID$:111010</Parameter><Parameter>$PORT$:GigabitEthernet0/0/8</Parameter><Parameter>$WANIP-2$:100.64.128.115</Parameter><Parameter>$AG3RegionNNvalue$:</Parameter><Parameter>$Port1$:TenGigabitEthernet0/0/27</Parameter><Parameter>$ring_number$:</Parameter></Parameter_List></Node><Node><Node_Name>INMUMUMBXXXXNB0016ENBESR002</Node_Name><Node_HostName>BGLRRLABECR002</Node_HostName><Node_Type>CSS</Node_Type><Node_Vendor>CISCO</Node_Vendor><Node_Model>CS-A901-6CZ-F-D-ESR</Node_Model><Template_ID>CSS_Template14</Template_ID><Template_Name>NON-RIL_Ethernet_SIP_CSS_Secondary_IPManaged</Template_Name><Parameter_List><Parameter>$VRFName$:RJIL-VRF-IP-CENTRIX</Parameter><Parameter>$WAN_IP_1$:100.64.128.112</Parameter><Parameter>$CustomerID$:9190052610</Parameter><Parameter>$bc_bandwidth$:937500</Parameter><Parameter>$rt_import$:64914:10001</Parameter><Parameter>$rt_import2:RT:import 64914:10001</Parameter><Parameter>$WANIP-1 NW$:100.64.128.112</Parameter><Parameter>$WANIP-2-VRRP$:100.64.128.115</Parameter><Parameter>$CUSTOMERNAME$:Tfnhq</Parameter><Parameter>$VLANID$:1634</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$InterfaceDescription$:UNI-ENT-IP Centrex-TFNH-5 Mbps-111010</Parameter><Parameter>$TCoS$:</Parameter><Parameter>$Port0$:GigabitEthernet0/0/8</Parameter><Parameter>$b_bandwidth$:5 Mbps</Parameter><Parameter>$description$:UNI-ENT-IP Centrex-TFNH-5 Mbps-111010</Parameter><Parameter>$rt_export$:64914:100</Parameter><Parameter>$device_ip$:10.64.229.240</Parameter><Parameter>$pbit$:6</Parameter><Parameter>$Route Distinguisher$:19.44.0.63:65</Parameter><Parameter>$ProductType$:IPC</Parameter><Parameter>$ServiceCode$:IPC</Parameter><Parameter>$ServiceID$:111010</Parameter><Parameter>$PORT$:GigabitEthernet0/0/8</Parameter><Parameter>$WANIP-2$:100.64.128.115</Parameter><Parameter>$WANIP-4$:100.64.128.114</Parameter><Parameter>$AG3RegionNNvalue$:</Parameter><Parameter>$Port1$:TenGigabitEthernet0/0/26</Parameter><Parameter>$ring_number$:</Parameter></Parameter_List></Node></Node_List></Service_Provisioning_Info></S:Body></S:Envelope>